snlkuharlocal/src/DataProcessors/ПисьмаОЛРНКСПревышениемЛимита/ПисьмаОЛРНКСПревышениемЛимита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПисьмаОЛРНКСПревышениемЛимита</name>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж/ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Емайл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПисьмоОтправленоДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>РНК</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтгрузкуРазрешил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтгружатьСПросроченнойЗадолженностью</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтгружатьСПревышениемЛимита</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ПисьмаОЛРНКСПревышениемЛимита/ObjectModule.bsl
#Область ОписаниеПеременных

Перем КритичОшибки Экспорт;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура СообщитьМенеджеру() Экспорт
	
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывод = ИспользованиеВывода.Разрешить;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	КритичОшибки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК КАК РНК,
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил КАК ОтгрузкуРазрешил
	               |ИЗ
	               |	РегистрСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж КАК ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж
	               |ГДЕ
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Период >= &Дата2
	               |	И НЕ ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.Отправлено
	               |	И НАЧАЛОПЕРИОДА(ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК.Дата, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(&Дата3, МЕСЯЦ)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.ОтгрузкуРазрешил,
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтгрузкуРазрешил,
	               |	ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.РНК.Контрагент,
	               |	РНК
	               |ИТОГИ ПО
	               |	ОтгрузкуРазрешил,
	               |	РНК";
				 
	Дата2 = ТекущаяДата() - 3 * (60 * 60 * 24);			 
	Дата3 = ДобавитьМесяц(Дата2, -1); 

	Запрос.УстановитьПараметр("Дата2", Дата2); 
	Запрос.УстановитьПараметр("Дата3", Дата3);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "ОтгрузкуРазрешил");
	
	Пока Выборка.Следующий() Цикл
		
		// ОЛ
		ОтгрузкуРазрешил = Выборка.ОтгрузкуРазрешил;
		ЕМэйл = ОтгрузкуРазрешил.ЕМэйл;
		
		Если СокрЛП(ЕМэйл) = "" Тогда
			
			КритичОшибки.Добавить("У ОЛ " + ОтгрузкуРазрешил + " не определен ЕМэйл.");
			
			Продолжить;
			
		КонецЕсли;
		
		// По документам
		ВыборкаДокументы = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "РНК");
		
		Если ВыборкаДокументы.Количество() = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;	
		
		ТекстПисьма = "Добрый день!" + Символы.ПС + Символы.ПС + "Сформированы следующие РНК с Вашим разрешением на отгрузку: "
		+ ОтгрузкуРазрешил + " (см. файл-вложение)";
		
		ТабДок.Очистить();
		
		ТабДок.Вывести(ОбластьШапка);
		
		НомерСтроки = 1;
		
		Пока ВыборкаДокументы.Следующий() Цикл
			
			РНК = ВыборкаДокументы.РНК;
			
			ОбластьСтрока.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
			ОбластьСтрока.Параметры.РНК = РНК;
			ОбластьСтрока.Параметры.Контрагент = РНК.Контрагент;
			ОбластьСтрока.Параметры.ГруппыТоваров = РНК.ГруппыТоваров;
			ОбластьСтрока.Параметры.СуммаДокумента = РНК.СуммаДокумента;
			ОбластьСтрока.Параметры.Валюта = РНК.Валюта;
			ОбластьСтрока.Параметры.КоличествоДокумента = РНК.КоличествоДокумента;
			ОбластьСтрока.Параметры.Менеджер = РНК.Менеджер;
			ОбластьСтрока.Параметры.Автор = РНК.Автор;
			ОбластьСтрока.Параметры.ОтгружатьСПревышениемЛимитаКредита = РНК.ОтгружатьСПревышениемЛимитаКредита;
			ОбластьСтрока.Параметры.ОтгружатьСПросроченнойЗадолженостью = РНК.ОтгружатьСПросроченнойЗадолженостью;
			ОбластьСтрока.Параметры.Отгружен = РНК.Отгружен;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		ИмяФайла = Константы.КаталогВнешнихОтчетов.Получить() 
		+ "ПисьмаОЛРНКСПревышениемЛимита\РНК с разрешенной отгрузкой с просроченной задолженностью (превышением лимита) - " 
		+ СокрЛП(ОтгрузкуРазрешил.Наименование) + ".xls";
		
		Попытка
			
			ТабДок.Записать(ИмяФайла, "xls");
			
		Исключение
			
			СообщитьПользователю(ОписаниеОшибки());
			
		КонецПопытки;
		
		СписокПолучателей = Новый СписокЗначений;
		
		СписокПолучателей.Добавить("krohin@collant.ru");
		СписокПолучателей.Добавить("nechaeva@collant.ru");
		СписокПолучателей.Добавить(ЕМэйл);
		
		ОшибкиУведомления = СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, 
		"Уведомление о РНК с разрешенной отгрузкой с просроченной задолженностью (превышением лимита)",
		, , ИмяФайла, "helpdesk@collant.ru");
		
		Если ОшибкиУведомления <> "" Тогда
			
			СообщитьПользователю(ОшибкиУведомления);
			
		Иначе
			
			// Ставим в регистре ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж: Отправлено = Истина; 
			ВыборкаДокументы.Сбросить();
			ВыборкаДокументы = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "РНК");
			
			Пока ВыборкаДокументы.Следующий() Цикл
				
				РНК = ВыборкаДокументы.РНК;
				
				Если РНК = Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				// Это отбор по 1 документу, по всем периодам проставим данные.	
				НаборЗаписей = РегистрыСведений.ОтгруженныеРНКСПревышениемЛимитаИлиПросрЗадолж.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.РНК.Значение = РНК;
				НаборЗаписей.Отбор.РНК.Использование = Истина;
				НаборЗаписей.Отбор.ОтгрузкуРазрешил.Значение = ОтгрузкуРазрешил;
				НаборЗаписей.Отбор.ОтгрузкуРазрешил.Использование = Истина;
				
				НаборЗаписей.Прочитать();
				
				Для Каждого Запись Из НаборЗаписей Цикл	

					Запись.Отправлено = Истина;
					Запись.ПисьмоОтправленоДата = ТекущаяДата();
					
				КонецЦикла;
				
				НаборЗаписей.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СообщитьКритОшибки();
	
КонецПроцедуры

Процедура СообщитьКритОшибки() Экспорт
	
	Если КритичОшибки.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль; 
	
	ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
	
	ЗаполнитьЗначенияСвойств(ПочтовыйПрофиль, ПараметрыПочты);	
	
	// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
	//ПочтовыйПрофиль.Пользователь       = "*%*%*%";
	//ПочтовыйПрофиль.Пароль             = "*$*$*$";
	ПочтовыйПрофиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
	ПочтовыйПрофиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
		Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
	// Ихсанов Д. А. Конец  14.10.2025
	ПочтовыйПрофиль.ВремяОжидания = 60; 
	
	СообщениеКрит = Новый ИнтернетПочтовоеСообщение;
	
	СообщениеКрит.Получатели.Добавить("krohin@collant.ru");
	СообщениеКрит.Получатели.Добавить("nechaeva@collant.ru");
	
	СообщениеКрит.Отправитель = "helpdesk@collant.ru";
	СообщениеКрит.Тема = "Критические ошибки! Уведомление о РНК с разрешенной отгрузкой с просроченной задолженностью (превышением лимита).";
	
	Почта = Новый ИнтернетПочта(); 
	
	Строка = "Добрый день!!!" + Символы.ПС;
	
	НомерСтроки = 1;
	
	Если КритичОшибки.Количество() > 0 Тогда
		
		Для Счетчик = 0 по КритичОшибки.Количество() - 1 Цикл
			
			Строка = Строка + Символы.ПС + НомерСтроки + ". " + КритичОшибки[Счетчик];
			Строка = Строка + Символы.ПС;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Строка = Строка + Символы.ПС + "________________________________________________________________";
	
	//-----------------------------------------
	СообщениеКрит.Тексты.Добавить(Строка);
	
	Почта = Новый ИнтернетПочта;
	Почта.Подключиться(ПочтовыйПрофиль);
	почта.Послать(СообщениеКрит);
	Почта.Отключиться();
	
КонецПроцедуры

//-----------------------------------------------------------------------
// запуск автообмена по загрузке РНК.

Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	
	// прайс выгружаем только один раз.
	СообщитьМенеджеру();
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьПользователю(ТекстСообщения)
	
	#Если Клиент Тогда
		
		Сообщить(ТекстСообщения);
		
	#Иначе
		
		ЗаписатьВЛог("ПисьмаОЛРНКСПревышениемЛимита", ТекстСообщения, "Информация");
		
	#КонецЕсли
	
КонецПроцедуры	

#КонецОбласти

#Область Инициализация

КритичОшибки = Новый Массив;
КритичОшибки.Очистить();

#КонецОбласти
